/*************************************************************************
	> File Name: 唯一分解定理.cpp
	> Author: 
	> Mail: 
	> Created Time: 2015年12月09日 星期三 12时57分44秒
 ************************************************************************/


 //唯一分解定理：
 int res[maxn];
 void getwy(int n)
 {
        for(int i=0; i<num; i++)    //num为素数的个数
     {
                while(n%prime[i] == 0)
         {
                        res[i]++;
                        n/=prime[i];
                    
         }
                if(n == 1) break;
            
     }

 }
